// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
Console.Write("Введите числа А и В:");
string AB = Console.ReadLine()!;
string[] AB = AB.Split(' ');
int x1 = int.Parse(parts_A[0]);
int y1 = int.Parse(parts_A[1]);
